#include <iostream>
using namespace std;

int main(){
    int a, b;
    while(cin >> a >> b){
        cout << a + b << "\n";
    }
    /*
    cin.eof()는 cin이 EOF를 읽을 때 ture를 반환한다.
    다음과 같은 코드는 마지막 값을 입력받고 난 뒤 (1)을 도달해야 cin.eof()가 true를 반환한다.
    이런 상황에서는 뒤에 cout << a + b << "\n";가 실행되는 것을 막을 수 없으므로 오류가 발생한다.
    -----------------------------------------------------------------------------------
    while(!cin.eof()){
        int a,b;

        cin >> a >> b; -(1)
        cout << a + b << "\n";
    }
    -----------------------------------------------------------------------------------

    아래 코드처럼 cin 함수 자체의 반환 값을 이용하거나
    -----------------------------------------------------------------------------------
    int a, b;
    while(cin >> a >> b){
        cout << a + b << "\n";
    }
    -----------------------------------------------------------------------------------
    
    아래 코드처럼 입력받은 직후에 검사해야 원하는 동작을 구현할 수 있다.
    -----------------------------------------------------------------------------------
    while(true){
        int a, b;
        
        cin >> a >> b;
        if(cin.eof()){
            break;
        }

        cout << a + b << "\n";
    }
    -----------------------------------------------------------------------------------
    */
}